{
   "class_name": "Functional",
   "config": {
      "name": "model",
      "layers": [
         {
            "class_name": "InputLayer",
            "config": {
               "batch_input_shape": [
                  null,
                  1
               ],
               "dtype": "float32",
               "sparse": false,
               "ragged": false,
               "name": "user"
            },
            "name": "user",
            "inbound_nodes": []
         },
         {
            "class_name": "InputLayer",
            "config": {
               "batch_input_shape": [
                  null,
                  1
               ],
               "dtype": "float32",
               "sparse": false,
               "ragged": false,
               "name": "anime"
            },
            "name": "anime",
            "inbound_nodes": []
         },
         {
            "class_name": "Embedding",
            "config": {
               "name": "user_embedding",
               "trainable": true,
               "batch_input_shape": [
                  null,
                  null
               ],
               "dtype": "float32",
               "input_dim": 91641,
               "output_dim": 128,
               "embeddings_initializer": {
                  "class_name": "RandomUniform",
                  "config": {
                     "minval": -0.05,
                     "maxval": 0.05,
                     "seed": null
                  }
               },
               "embeddings_regularizer": null,
               "activity_regularizer": null,
               "embeddings_constraint": null,
               "mask_zero": false,
               "input_length": null
            },
            "name": "user_embedding",
            "inbound_nodes": [
               [
                  [
                     "user",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Embedding",
            "config": {
               "name": "anime_embedding",
               "trainable": true,
               "batch_input_shape": [
                  null,
                  null
               ],
               "dtype": "float32",
               "input_dim": 17560,
               "output_dim": 128,
               "embeddings_initializer": {
                  "class_name": "RandomUniform",
                  "config": {
                     "minval": -0.05,
                     "maxval": 0.05,
                     "seed": null
                  }
               },
               "embeddings_regularizer": null,
               "activity_regularizer": null,
               "embeddings_constraint": null,
               "mask_zero": false,
               "input_length": null
            },
            "name": "anime_embedding",
            "inbound_nodes": [
               [
                  [
                     "anime",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dot",
            "config": {
               "name": "dot_product",
               "trainable": true,
               "dtype": "float32",
               "axes": 2,
               "normalize": true
            },
            "name": "dot_product",
            "inbound_nodes": [
               [
                  [
                     "user_embedding",
                     0,
                     0,
                     {}
                  ],
                  [
                     "anime_embedding",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Flatten",
            "config": {
               "name": "flatten",
               "trainable": true,
               "dtype": "float32",
               "data_format": "channels_last"
            },
            "name": "flatten",
            "inbound_nodes": [
               [
                  [
                     "dot_product",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Dense",
            "config": {
               "name": "dense",
               "trainable": true,
               "dtype": "float32",
               "units": 1,
               "activation": "linear",
               "use_bias": true,
               "kernel_initializer": {
                  "class_name": "HeNormal",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": null,
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "dense",
            "inbound_nodes": [
               [
                  [
                     "flatten",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  1
               ],
               "momentum": 0.99,
               "epsilon": 0.001,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization",
            "inbound_nodes": [
               [
                  [
                     "dense",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation",
               "trainable": true,
               "dtype": "float32",
               "activation": "sigmoid"
            },
            "name": "activation",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         }
      ],
      "input_layers": [
         [
            "user",
            0,
            0
         ],
         [
            "anime",
            0,
            0
         ]
      ],
      "output_layers": [
         [
            "activation",
            0,
            0
         ]
      ]
   },
   "keras_version": "2.4.0",
   "backend": "tensorflow"
}